//
//  UserAgreement.swift
//  TravelSchedule
//
//  Created by Danil Kazakov on 15.06.2025.
//

enum UserAgreement {
    static let text = """
        Оферта на оказание образовательных услуг дополнительного образования Яндекс.Практикум для физических лиц

        Настоящий документ представляет собой оферту Автономной Некоммерческой Организации Дополнительного Профессионального Образования «Образовательные технологии Яндекса» Студентам.

        Оферта считается направленной с момента ее публикации по адресу: https://yandex.ru/legal/practicum_offer и действует весь период размещения настоящей Оферты по указанному адресу.

        1. ТЕРМИНЫ

        Понятия, используемые в настоящей Оферте, означают следующее:

        Авторизованные адреса — адреса электронной почты каждой Стороны. Авторизованным адресом Исполнителя является адрес электронной почты, указанный в разделе 11 Оферты. Авторизованным адресом Студента является адрес электронной почты, указанный Студентом в Личном кабинете.

        Вводный курс — начальный курс обучения, предусмотренный в отдельных представленных в Сервисе Программах обучения в рамках выбранного Студентом Курса, рассчитанный на определенное количество часов самостоятельного обучения, который однократно предоставляется Студенту при регистрации в Сервисе на безвозмездной основе. В процессе обучения в рамках Вводного курса Студенту предоставляется возможность ознакомления с работой Сервиса и определения возможности Студента продолжить обучение в рамках Полного курса по выбранному Студентом Курсу. Точное количество часов обучения в рамках Вводного курса зависит от выбранного Студентом Курса и определяется в Программе обучения, размещенной на Сервисе. Максимальный срок освоения Вводного курса составляет 1 год с даты начала обучения.

        Договор об образовании — договор об оказании платных образовательных услуг по дополнительным образовательным программам (дополнительным общеобразовательным программам и дополнительным профессиональным программам), заключенный между Исполнителем и Студентом (или его Законным представителем в случае недостижения Студентом возраста, с которого законодательством Российской Федерации допускается заключение данного договора) в письменной форме в соответствии с пунктом 2 статьи 434 ГК РФ путем обмена электронными документами, а именно путем акцепта Студентом Оферты в порядке, предусмотренном в разделе 4 настоящей Оферты.

        Исполнитель — Автономная Некоммерческая Организация Дополнительного Профессионального Образования «Образовательные технологии Яндекса», ОГРН 1147799006123, Лицензия № Л035-01298-77/00185314 от 24 марта 2015 года, место нахождения: 119021, Россия, г. Москва, ул. Тимура Фрунзе, д. 11, корпус 2, https://practicum.yandex.ru.

        Когорта — группа Студентов, зачисляемая на выбранную такими Студентами Программу обучения в рамках Полного курса. Дата начала обучения Когорты отображается на странице оплаты при оплате Студентом Полного курса, а после оплаты в Личном кабинете Студента.

        Курс — направление обучения по Программам, представленным на Сервисе, с определенным набором модулей, информация о которых размещена на Сервисе.

        Личный кабинет/Личный кабинет Студента — специальный раздел Сервиса, позволяющий зарегистрированному и авторизованному Студенту получить доступ к своей Персональной информации в Сервисе, а также полученным и приобретенным Студентом Программам, включая все методические материалы, аудиовизуальный контент, предоставленный в рамках Программ.

        Модуль — набор обучающих текстов, аудиовизуальных материалов и практических задач, объединенных определенной тематикой в рамках Программ.

        Оферта — настоящий документ, представляющий собой оферту, направленную Исполнителем Студентам на заключение Договора об образовании на Сервисе, размещенный в открытом доступе в сети «Интернет» по адресу: https://yandex.ru/legal/practicum_offer.

        Пакет занятий — количество занятий, содержащееся в приобретённой Студентом/Пользователем Программе английского языка. Количество занятий в Программах английского языка размещено по адресу https://practicum.yandex.ru/english. График проведения занятий по Программам английского языка фиксируется в Личном кабинете.

        Персональная информация — информация о Студенте и/или Законном представителе, включая персональные данные, предоставленная Студентом или Законным представителем в Сервисе, при акцепте Оферты или иным образом в связи с использованием Сервиса с целью исполнения условий Оферты. Программы английского языка - образовательные Программы по обучению английскому языку, перечень которых указан по адресу https://practicum.yandex.ru/english

        Полный курс — расширенный платный курс обучения по представленным в Сервисе Программам в рамках выбранного Студентом Курса, рассчитанный на определенное количество часов обучения (самостоятельное обучения и обучение с привлечением преподавателей), включающий в себя расширенный набор теоретических, практических, аудиовизуальных материалов для самостоятельного обучения, а также возможность персонального сопровождения Студента в рамках выбранного Студентом Курса практикующим специалистом Сервиса (наставником, тьютором, тренером), если это предусмотрено Программой обучения. Точное количество часов обучения в рамках Полного курса зависит от выбранного Студентом Курса и определяется в Программе обучения, размещенной в Сервисе. Обучение по программе Полного курса может происходить в Когортах, если это предусмотрено соответствующим Курсом. Дата начала обучения устанавливается для всей Когорты. Максимальный срок освоения Полного курса указан в Сервисе.

        Пользовательское соглашение/Условия Сервиса — условия использования Сервиса, размещенные в сети Интернет по адресу: https://yandex.ru/legal/practicum_termsofuse.

        Привязанная банковская карта — одна или несколько банковских карт Студента, данные которых указаны и доступны в Сервисе, в соответствии с Пользовательским соглашением и в соответствии с Офертой, а также данные которой доступны в учетной записи Студента на сервисе «Яндекс ID», доступного по адресу: https://passport.yandex.ru в соответствии с пользовательским соглашением сервисов Яндекса, размещенным в сети Интернет по адресу: https://yandex.ru/legal/rules.

        Программа/Образовательная программа — дополнительная профессиональная программа или дополнительная общеобразовательная общеразвивающая программа в форме обучения (в том числе в форме индивидуального обучения, если это предусмотрено соответствующим Курсом) по определенному Курсу, размещенная на Сервисе. Программа обучения может состоять из Вводного и Полного курсов. Срок освоения Программы размещен на Сервисе.

        Сервис — сервис Яндекс.Практикум, доступный для Студентов по адресу: https://practicum.yandex.ru и https://practicum.yandex.ru/english, с использованием которого Исполнитель оказывает Услуги Студентам.

        Стоимость обучения — стоимость Полного курса обучения, указанная в Сервисе.

        Стороны — совместное упоминание Исполнителя и Студента.

        Студент/Пользователь — любое совершеннолетнее физическое лицо или несовершеннолетнее физическое лицо в лице его Законного представителя, а в случае достижения четырнадцатилетнего возраста - действующее с согласия и под наблюдением Законного представителя, являющееся зарегистрированным и авторизованным пользователем согласно Условиям Сервиса, которое ознакомилось с условиями настоящей Оферты и акцептовало настоящую оферту путем нажатия кнопки/проставления галочки в пункте «Начать учиться»/«Купить» или «Принимаю условия Пользовательского соглашения» и «Оферты» в Сервисе.

        Законный представитель — родитель, усыновитель или опекун несовершеннолетнего Студента. По смыслу настоящей Оферты при каждом упоминании Студента, являющегося несовершеннолетним, а также при упоминании прав, обязательств или действий такого Студента, подразумевающих создание, изменение или прекращение правоотношений в рамках настоящей Оферты, понимается Законный представитель такого Студента.

        Услуга — образовательная услуга по Программам, оказываемая Исполнителем Студенту в соответствии с выбранным Студентом Курсом на Сервисе в дистанционной (онлайн) форме обучения на Сервисе.

        Условия использования Промокодов — условия использования Промокодов в рамках Курсов «Яндекс.Практикум», расположенные в сети Интернет по адресу: https://yandex.ru/legal/practicum_promocode.

        Термины, не определенные в настоящем разделе, будут иметь значения, данные им в действующей редакции Гражданского кодекса Российской Федерации и иных нормативно-правовых актах РФ.

        2. ПРЕДМЕТ

        2.1. Предметом настоящей Оферты является оказание Услуг Исполнителем Студентам в порядке и на условиях, предусмотренных настоящей Офертой.

        2.2. Описание Программы в рамках Сервиса, а также полная стоимость Услуг, порядок и способы их оплаты, указаны на странице Сервиса.

        2.3. В случае акцепта настоящей оферты Студентом и выбора Студентом Программы, Исполнитель оказывает Студенту Услуги в рамках Вводного курса обучения, если он предусмотрен Программой, на безвозмездной основе. Все обучающие материалы, предоставляемые Исполнителем в рамках Вводного курса, становятся доступными Студенту для самостоятельного обучения в Личном кабинете Студента.

        2.4. В рамках Сервиса Исполнитель предоставляет Студенту доступ к различным Модулям постепенно согласно Программе обучения в порядке, предусмотренном Программой обучения.

        После прохождения Студентом Вводного курса обучения, если он предусмотрен Программой, Студент может оставить заявку на прохождение Полного курса обучения в Личном кабинете Студента. Исполнитель рассматривает заявку Студента, после чего Студенту предоставляется возможность пройти Полный курс обучения по Программе, подробное описание и стоимость которой размещается на странице Сервиса. Оплата обучения осуществляется в соответствии с пунктом 5.3. Оферты.

        2.5. В случае если Студент направляется на обучение организацией (юридическим лицом или индивидуальным предпринимателем), осуществляющей оплату обучения за такого Студента в соответствии с заключенным между такой организацией и Исполнителем договором, Студент подтверждает, что ознакомлен и согласен с условиями такого договора, размещенными в сети Интернет по адресу: https://yandex.ru/legal/practicum_service_offer.

        2.6. Если это предусмотрено соответствующей Программой, то после её успешного прохождения Студенту предоставляется возможность пройти онлайн экзамен. Форма проведения экзамена определяется Исполнителем.

        В случае успешного прохождения Студентом данного экзамена, Студенту выдается один из следующих документов с указанием количества прослушанных часов в рамках по выбранного Студентом Курса:

        документ о квалификации (удостоверение о повышении квалификации или диплом о профессиональной переподготовке), подтверждающий получение Студентом дополнительного профессионального образования;
        документ об обучении (свидетельство, сертификат или иное), подтверждающий прохождение Студентом обучения по дополнительной общеразвивающей программе.
        Требования для успешного прохождения экзамена определяются Исполнителем для каждой Программы и обозначаются в Сервисе перед началом прохождения экзамена.

        2.7. В случае нежелания Студента после прохождения Программы обучения пройти экзамен или в случае неудачной сдачи экзамена, Студенту предоставляется справка с наименованием Программы обучения и отметкой о количестве часов обучения по указанной Программе, которые прошел Студент. В случае повторного зачисления Студента на обучение по Программе обучения, Исполнитель вправе зачесть Студенту количество часов, указанное в справке.

        2.8. В случае использования Студентом Промокода и/или Сертификата к отношениям Сторон применяются Условия использования Промокодов и/или Сертификатов. В случае противоречий между Условиями использования Промокодов и/или Сертификатов и Офертой, преимущественную силу имеют Условия использования Промокодов и/или Сертификатов. Активируя Промокод Студент подтверждает, что ознакомлен и согласен с Условиями использования Промокодов и/или Сертификатов.

        3. ПРАВА И ОБЯЗАННОСТИ СТОРОН

        3.1. Студент имеет право:

        3.1.1. Получать информацию об условиях оказания Услуг Исполнителем и иную информацию в отношении Услуг способами, указанными в Сервисе. В случае возникновения вопросов обратиться в службу поддержки Исполнителя по Авторизованному адресу.

        3.1.2. После прохождения обучения в рамках Вводного курса, приобрести Полный курс обучения за ту стоимость, которая указана на Сервисе в момент подачи Студентом через Личный кабинет Студента заявки на прохождение Полного курса обучения.

        3.1.3. Отказаться от приобретенной Студентом Программы обучения и расторгнуть Договор об образовании в соответствии с разделом 7 Оферты. Такой отказ влечет за собой прекращение всех обязанностей Исполнителя перед Студентом, предусмотренных настоящей Офертой. В случае расторжения Договора об образовании Студенту выдается справка с указанием количества часов обучения, пройденных Студентом по выбранному Студентом Курсу, включая Вводный курс.

        3.1.4. Получить Услугу в соответствии с выбранным Студентом Курсом и материалами в рамках этого Курса.

        3.1.5. Если это предусмотрено соответствующим Курсом, по согласованию с Исполнителем в ходе обучения по Программе (за исключением Курсов длительностью менее одного месяца) сменить Когорту в соответствии со следующими правилами:

        3.1.5.1. После соответствующего согласования с Исполнителем Студент переходит из Когорты, в которую он был зачислен изначально, в одну из Когорт, следующих по дате начала обучения после Когорты этого Студента.

        3.1.5.2. Чтобы сменить свою Когорту Студент оставляет заявку через форму, размещённую в сети «Интернет» по адресу: https://yandex.ru/support/praktikum/transfer.html.

        3.1.6. Реализовывать иные права Студента, предоставляемые обучающемуся в соответствии с действующим законодательством Российской Федерации.

        3.2. Студент обязан:

        3.2.1. Подробно ознакомиться со всеми условиями настоящей Оферты, а также с Условиями Сервиса и принять их в полном объеме при акцепте настоящей Оферты.

        3.2.2. Использовать учебные материалы исключительно в целях самостоятельного обучения в соответствии с условиями, определенными в настоящей Оферте и Условиях Сервиса, не копировать учебные материалы, не передавать их третьим лицам.

        3.2.3. При акцепте настоящей Оферты предоставить Исполнителю необходимую Персональную информацию, включающую в себя:

        ФИО Студента,
        номер телефона Студента,
        адрес места жительства Студента,
        информацию о Законном представителе Студента,
        а также иную информацию, перечень которой определен в анкетах, предоставляемых Студенту для заполнения при оформлении Услуг и в процессе обучения.
        Студент признает, что не имеет никаких претензий к Исполнителю за некорректно предоставленные Студентом данные в случае, если Студент сам не удостоверился в их корректности во время приобретения Услуг.

        3.2.4. Самостоятельно выполнять практические задания в рамках выбранного Студентом Курса в сроки и в порядке, предусмотренном соответствующей Программой.

        3.2.5. При выполнении практических заданий в рамках выбранного Студентом Курса не использовать выполненные практические задания и/или части выполненных практических заданий других студентов.

        3.2.6. При обучении соблюдать нравственное и этическое поведение по отношению к любым лицам, в том числе, но не ограничиваясь: не использовать ненормативную лексику, не оскорблять, не осуществлять дискриминирующих высказываний по любым основаниям, не осуществлять иных противоправных и антиморальных действий в отношении любых лиц.

        3.2.7. Своевременно оплачивать Стоимость обучения, указанную в Сервисе, в порядке, предусмотренном пунктом 5.3. настоящей Оферты.

        3.2.8. Обеспечить наличие стационарного оборудования и программного обеспечения, необходимого для проведения занятий, а именно:

        Операционная система: Windows 7/8/8.1/10, macOS 10.12 и новее;
        Браузер: Google Chrome/ Yandex Browser/ Opera/ Safari/ Edge последней стабильной версии;
        Оперативная память: 4 ГБ или больше;
        Процессор: двухъядерный @ 2 ГГц или мощнее;
        Интернет-соединение: от 5 Мбит/сек;
        Наличие исправного микрофона и видеокамеры;
        Исполнитель не несет ответственности за качество оказанных Исполнителем Услуг, если Пользователь/Студент нарушил обязательство, предусмотренное настоящим пунктом, а также в случае если Студент использует для подключения к занятию мобильное устройство (планшет или телефон).

        3.3. Исполнитель имеет право:

        3.3.1. Требовать от Студента предоставить Исполнителю Персональную информацию, необходимую для оказания Исполнителем Услуг, перечень которой определен в анкете, предоставляемой Студенту для заполнения при оформлении Услуг, а также оплаты Стоимости обучения в порядке и на условиях, изложенных в настоящей Оферте.

        3.3.2. Устанавливать и/или изменять Стоимость обучения в одностороннем порядке и в любое время, разместив соответствующую информацию в Сервисе.

        3.3.3. Отказать Студенту в оказании Услуг при несоблюдении Студентом любого из положений настоящей Оферты и Условий Сервиса.

        3.3.4. При расторжении Договора об образовании, ограничить возможность Студента использовать учебные материалы Курса.

        3.4. Исполнитель обязан:

        3.4.1. Оказать Студенту Услугу по Программе в соответствии с выбранным Студентом Курсом на основании Лицензии на осуществление образовательной деятельности № № Л035-01298-77/00185314 от «24» марта 2015 г. в соответствии с условиями настоящей Оферты.

        3.4.2. При оплате Полного курса, предоставлять Студенту расширенные функциональные возможности Сервиса, предусмотренные Сервисом для Студентов Полного курса;

        3.4.3. Предоставлять Студенту по его запросу информацию об условиях оказания Услуг Исполнителем, а также предоставлять Студенту на Сервисе учебные, информационные и справочные материалы в зависимости от выбранного Студентом Курса.

        3.4.4. Провести обучение в соответствии с утвержденным учебным планом выбранного Студентом Курса.

        3.4.5. Не использовать персональные данные Студента и/или Законного представителя, предоставленные Исполнителю в рамках акцепта Оферты, для целей, не относящихся к исполнению условий Оферты и Условий Сервиса.

        3.4.6. Осуществлять обработку Персональной информации Студента и/или Законного представителя в соответствии с требованиями законодательства Российской Федерации, Условий Сервиса и Политики конфиденциальности, опубликованной по адресу: https://yandex.ru/legal/confidential.

        3.5. Приобретая Услугу на условиях настоящей Оферты, Студент подтверждает, что он ознакомился с Программой обучения по выбранному Студентом Курсу, представленной в Сервисе. Исполнитель оставляет за собой право вносить изменения в Программу обучения. В случае внесения таких изменений Исполнитель не обязан уведомлять об этом Студента каким-либо образом. Студент соглашается с тем, что он самостоятельно будет отслеживать такие изменения в Программе обучения в Сервисе.

        3.6. Персональная информация Студента и (или) Законного представителя обрабатывается на условиях Политики конфиденциальности (https://yandex.ru/legal/confidential) и в соответствии с положениями Оферты и Пользовательского соглашения.

        Предоставляя Персональную информацию Студента, Законный представитель подтверждает, что имеет законное основание обрабатывать Персональную информацию Студента таким образом.

        В целях исполнения условий Оферты, Персональная информация Студента и (или) Законного представителя может быть передана лицам, привлекаемым к оказанию Услуг (персональным сопровождающим специалистам в Сервисе), ООО «ЯНДЕКС» и его аффилированным лицам, лицам, выступающим заказчиком Услуг в отношении Студента, а также иным лицам, привлекаемым Исполнителем в процессе оказания Услуг.

        4. ПОРЯДОК АКЦЕПТА ОФЕРТЫ

        4.1. Оказание Услуг Студенту производится исключительно на условиях настоящей Оферты и только при условии полного и безоговорочного принятия Студентом условий настоящей Оферты (акцепта Оферты). Частичный акцепт либо акцепт на иных условиях не допускается. Если Студент не принимает в полном объеме условия настоящей Оферты, оказание ему Услуг Исполнителем не производится.

        4.2. Акцептом Оферты считается последовательное осуществление Студентом следующих действий:

        4.2.1. Выбор Студентом Программы обучения на Сервисе и нажатие кнопки «Начать учиться»/ «Купить»;

        4.2.2. Ознакомление с Офертой и Условиями Сервиса;

        4.2.3. Проставление галки в поле с текстом: «Принимаю условия «Пользовательского соглашения» и «Оферты».

        4.3. С момента совершения совокупности действий, указанных в пунктах 4.2.1. - 4.2.3., Оферта считается акцептованной Студентом, что является подтверждением заключения Договора об образовании. После окончания Вводного курса (при наличии такового) Студенту предоставляется возможность подать заявку на продолжение обучения в соответствии с условиями настоящей Оферты, либо расторгнуть Договор об образовании при завершении Студентом обучения в рамках Вводного курса и не подачи Студентом заявки на Полный курс обучения через Личный кабинет Студента.

        4.4. Для акцепта Оферты физическое лицо должно быть авторизовано с помощью сервиса «Яндекс ID», доступного по адресу: https://passport.yandex.ru.

        4.5. Акцептуя настоящую Оферту, Студент также подтверждает, что он ознакомился с образовательными программами, учебными планами, локальными нормативными актами и иными документами Исполнителя, размещенными по адресу https://yandex.ru/edtech/documents и обязуется исполнять обязанности, возложенные на него указанными документами.

        5. ВЫБОР ПРОГРАММЫ ОБУЧЕНИЯ И ПОРЯДОК СОВЕРШЕНИЯ ПЛАТЕЖЕЙ

        5.1. Для оформления обучения Студент:

        создает на Сервисе Личный кабинет путем авторизации через Яндекс ID,
        выбирает Курс, на котором он бы хотел обучаться в рамках предложенных Программ, акцептует Оферту, и
        заключает Договор об образовании.
        При создании Личного кабинета на Сервисе Студент вносит всю необходимую Персональную информацию о себе, перечень которой определен в пункте 3.2.3. настоящей Оферты.

        5.2. Стоимость обучения в рамках Курса указывается в Сервисе.

        5.3. Студент оплачивает Стоимость обучения в безналичном порядке в рамках Курса путем выбора на Сервисе одного из следующих способов:

        5.3.1. Оплата полной Стоимости обучения за весь Курс до начала обучения.

        5.3.2. Оплата Стоимости обучения равными ежемесячными платежами. Количество платежей составляет количество месяцев срока обучения по Полному курсу. Размер ежемесячного платежа отражается в Личном кабинете Студента при выборе способа оплаты на Сервисе.

        5.3.3. Оплата третьим лицом за Студента Полной стоимости обучения за весь Полный курс до начала обучения.

        5.3.4. Оплата Стоимости обучения путем автоматического списания с Привязанной банковской карты Студента равных ежемесячных платежей. Размер ежемесячного платежа отражается в Личном кабинете Студента при выборе способа оплаты в Сервисе.

        5.4. Оплата в соответствии с пунктом 5.3.4. настоящей Оферты осуществляется посредством списания денежных средств с Привязанной банковской карты Студента.

        При этом доступ к Курсу предоставляется только после совершения первого ежемесячного платежа. Второй ежемесячный платеж списывается через 27 (двадцать семь) календарных дней с даты начала обучения по Полному курсу. Последующие ежемесячные платежи списываются через каждые 30 (тридцать) календарных дней с даты предыдущего платежа.

        Списание денежных средств в соответствии с настоящим пунктом Оферты начинает происходить на автоматической основе при соблюдении следующих условий:

        ввода Студентом всех необходимых реквизитов Привязанной карты;
        активации сервиса по списанию денежных средств на автоматической основе с Привязанной карты следующим способом: автоматически при совершении первого платежа;
        акцепта настоящей Оферты.
        5.5. Исполнитель производит списания очередных платежей, предусмотренных пунктом 5.3.4. настоящей Оферты, с Привязанной банковской карты, указанной Студентом при совершении первого платежа.

        5.6. В случае отсутствия достаточного количества денежных средств на Привязанной банковской карте Студента, или невозможности списания Исполнителем денежных средств с Привязанной банковской карты Студента по иным причинам, Студент обязуется пополнить Привязанную банковскую карту для повторного списания очередного платежа Исполнителем.

        5.7. После оплаты полной Стоимости обучения или оплаты очередного платежа, предусмотренного п. 5.3.4. настоящей Оферты, в Личном кабинете Студента в Сервисе появится подтверждение оплаты.

        5.8. Стоимость Обучения считается оплаченной Студентом с момента списания полной Стоимости обучения или первого и всех очередных платежей, предусмотренных пунктом 5.3.4 настоящей Оферты с Привязанной банковской карты Студента для перечисления на расчетный счет Исполнителя.

        5.9. Перечисленная Студентом Стоимость обучения начинает ежедневно списываться равными частями в течение всего срока освоения Курса, начиная с даты начала обучения Когорты, указанной в Личном кабинете Студента, в том числе и в течение периода смены Когорты по инициативе Студента в соответствии с правилами п. 3.1.5. настоящей Оферты.

        В отношении Студентов Программ английского языка, списание осуществляется по факту завершения занятия, запланированного графиком занятий, а также в случае повторной отмены занятия, запланированного графиком занятий, по инициативе Студента. Если Студент пропустил занятие, внесенное в график занятий, то такое занятие считается проведённым, услуга оказанной и денежные средства за такое занятие списываются.

        5.10. Исполнитель вправе отозвать настоящую Оферту, расторгнуть Договор об образовании со Студентом и закрыть доступ ко всем материалам, необходимым для обучения по Программе обучения в любое время, уведомив об этом Студента в Личном кабинете или иным способом предусмотренным на Сервисе, в случае неоплаты Студентом очередного платежа, предусмотренного выбранным способом оплаты в соответствии с пунктом 5.3. настоящей Оферты.

        5.11. Исполнитель вправе в любое время по своему усмотрению ограничить возможность использования любого из способов оплаты, указанных в пункте 5.3 настоящей Оферты.

        6. ПЛАТЕЖНЫЕ ДАННЫЕ

        6.1. В целях предоставления Студенту дальнейшей возможности оплаты Стоимости обучения в соответствии с пунктом 5.3.3. настоящей Оферты, Студент привязывает свою банковскую карту к Сервису в Личном кабинете.

        6.2. Привязанная банковская карта указывается Студентом при регистрации на Сервисе, при этом Студент вводит следующие данные:

        Номер банковской карты;
        Действительна до;
        Защитный код.
        Если данные банковской карты верны, действительны и использование данной карты в рамках Сервиса технически возможно, указанная банковская карта приобретает статус Привязанной и может быть использована для оплаты Стоимости обучения.

        6.3. При указании своих данных согласно пункту 6.2 настоящей Оферты и дальнейшем использовании Привязанной карты Студент подтверждает и гарантирует указание им достоверной и полной информации о действительной банковской карте, выданной на его имя; соблюдение им правил международных платежных систем и требований банка-эмитента, выпустившего Привязанную карту, в том числе в отношении порядка проведения безналичных расчетов.

        6.4. Исполнитель оставляет за собой право в любой момент потребовать от Студента подтверждения данных, указанных им в рамках Сервиса, в том числе данных Привязанной карты, и запросить в связи с этим подтверждение личности Пользователя путем как личного присутствия в офисе Сервиса, так и предоставление подтверждающих документов (в частности, документов, удостоверяющих личность).

        7. ПОРЯДОК ОТКАЗА ОТ ОБУЧЕНИЯ И ВОЗВРАТА ДЕНЕЖНЫХ СРЕДСТВ

        7.1. Возврат денежных средств за приобретенный Студентом Полный Курс возможен лишь в порядке и на условиях, установленных настоящей Офертой.

        7.2. Студент имеет право полностью отказаться от Вводного курса (если он предусмотрен) и расторгнуть Договор об образовании в любой день с даты начала обучения.

        7.3. Студент имеет право полностью отказаться от приобретенного Полного курса и расторгнуть Договор об образовании в течение 1 (одного) года с даты оплаты Полного курса путем подачи заявки по следующему адресу, расположенному в сети Интернет: https://yandex.ru/support/praktikum/paid-continuing-education.html#refund.

        Исполнитель обязуется возвратить Студенту денежные средства, оплаченные Студентом за Программу за вычетом стоимости фактически оказанных Исполнителем Студенту Услуг на банковскую карту, с которой осуществлялась оплата Стоимости обучения.

        7.3.1. Сумма возврата определяется в следующем порядке:

        7.3.1.1. Формула для расчета стоимости одного дня обучения по Программе обучения:

        Y = X / N1, где

        Y — Стоимость обучения за один день Полного курса или за одно занятие из Пакета занятий для Программ английского языка;

        X — Стоимость обучения Полного курса или Пакета занятий для Программ английского языка,

        N1 — количество дней Полного курса по Программе обучения или количество занятий в Пакете занятий для Программ английского языка.

        Стороны соглашаются, что в случае перехода Слушателя из первой Когорты, в которую он был зачислен, в другую, для целей возврата денежных средств, количество дней Полного курса по Программе обучения (N1) рассчитывается исходя из продолжительности обучения первой Когорты.

        7.3.1.2. Сумма возврата Полного курса или Пакета занятий для Программ английского языка рассчитывается по формуле:

        Z = P — Y * N2, где

        Z — Сумма возврата по Полному курсу или Пакету занятий для Программ английского языка,

        Y — Стоимость обучения за один день Полного курса или Стоимость одного занятия в Пакете занятий для Программ английского языка,

        P — Стоимость обучения по Программе обучения, оплаченная студентом,

        N2 — количество дней обучения (включая периоды смены Когорты) или количество занятий по Программе английского языка с даты начала обучения до дня отказа Студента от Полного курса обучения или от Пакета занятий для Программ английского языка (включительно).

        7.4. Исполнитель вправе удержать из Суммы возврата по Программе обучения фактически понесенные Исполнителем расходы, необходимые для исполнения Договора об образовании.

        7.5. Срок возврата денежных средств Исполнителем составляет 10 (десять) календарных дней с момента направления Студентом уведомления об отказе Студента от Полного курса, направленного в порядке, предусмотренном пунктом 7.3 Оферты, при условии своевременного и полного предоставления Студентом документов, необходимых для возврата (в том числе документов, запрошенных Исполнителем в порядке, предусмотренном пунктом 6.4 Оферты).

        7.6. Услуги, оказанные в течение соответствующего Периода, считаются оказанными Исполнителем надлежащим образом и принятыми Студентом в полном объеме, если в течение трех календарных дней по завершении периода оказания Услуг Исполнитель не получил от Студента мотивированных письменных возражений. Периодом оказания Услуг является календарный месяц. Первым периодом оказания Услуг Стороны признают период с даты начала обучения по последнее число месяца начала обучения, последним периодом оказания Услуг является период с даты месяца начала по дату расторжения оферты/окончания обучения. По истечении срока, указанного выше, претензии Пользователя относительно недостатков Услуг, в том числе по количеству (объему), стоимости и качеству не принимаются. Акт об оказанных услугах формируется Исполнителем в электронном виде по окончании каждого периода оказания Услуг, направляется Студенту в электронном виде по Авторизованному адресу только по запросу Студента, направленному на Авторизованный адрес Исполнителя.

        8. СРОК ДЕЙСТВИЯ И ПОРЯДОК ИЗМЕНЕНИЯ, РАСТОРЖЕНИЯ ОФЕРТЫ

        8.1. Настоящая Оферта вступает в силу с даты ее публикации по адресу https://yandex.ru/legal/practicum_offer и действует до момента отзыва настоящей оферты Исполнителем. После отзыва Оферты Исполнителем акцепт Оферты не допускается.

        8.2. С учетом условий п. 8.4. Оферты, Исполнитель имеет право вносить изменения в текст настоящей Оферты. Такие изменения публикуются своевременно и находятся в общем доступе по адресу https://yandex.ru/legal/practicum_offer, вступают в силу с момента их опубликования, если иное не предусмотрено Офертой. В случае внесения изменений в текст настоящей Оферты Исполнитель не обязан дополнительно извещать об этом Студентов.

        8.3. Исполнитель также имеет право вносить изменения в Программы обучения, публикуемые на Сервисе, а также изменять перечень Курсов, предлагаемых в рамках предложенных Программ обучения.

        8.4. К отношениям Сторон будет применяться редакция/версия Оферты, действующая в момент Акцепта ее Студентом.

        8.5. Исполнитель вправе в одностороннем внесудебном порядке отозвать настоящую Оферту и расторгнуть Договор об образовании со Студентом в любое время, уведомив об этом Студента в Личном кабинете, в случае нарушения Студентом условий Оферты, локальных нормативных актов Исполнителя, требований законодательства Российской Федерации и невыполнения и/или нарушения Студентом своих обязанностей, предусмотренных в пункте 3.2. Оферты.

        8.6. В случаях, указанных в пункте 8.5. Исполнитель обязуется возвратить Студенту на банковскую карту, с которой осуществлялась оплата Стоимости обучения, Сумму возврата за вычетом стоимости пройденного количества дней с даты начала занятий по Программам английского языка/начала обучения Когорты в рамках Полного курса по дату направления Исполнителем Студенту уведомления о расторжении Договора об образовании включительно. Дата начала обучения Когорты отображается в Личном кабинете Студента. Сумма возврата, рассчитывается Исполнителем с первого рабочего дня следующего за датой направления Исполнителем уведомления о расторжении Договора об образовании. Сумма возврата определятся в порядке, установленном в пункте 7.3.1. Оферты.

        9. ОТВЕТСТВЕННОСТЬ СТОРОН. РАЗРЕШЕНИЕ СПОРОВ

        9.1. Стороны не несут ответственность, если неисполнение или ненадлежащее исполнение условий Оферты вызвано обстоятельствами непреодолимой силы, возникшими против воли и желания Сторон, и которые они не могли предотвратить, избежать или предвидеть (форс-мажорные обстоятельства).

        9.2. Студент несет всю ответственность согласно действующему законодательству Российской Федерации за последствия, возникшие в результате предоставления им недостоверной или заведомо ложной Персональной информации, и несет ответственность за нарушение прав и интересов других лиц в результате таких действий. Студент соглашается с тем, что в случае предоставления им Исполнителю недостоверной или заведомо ложной Персональной информации, Исполнитель оставляет за собой право отказать Студенту в оказании Услуг даже при условии оплаты Студентом стоимости обучения.

        9.3. Исполнитель не несет ответственности за несоответствие обучения ожиданиям Студентам и/или его субъективной оценке.

        9.4. Все споры и разногласия, возникающие между Сторонами, будут разрешаться в претензионном порядке. Претензия подлежит передаче Исполнителю в письменном виде по адресу Исполнителя, указанному в настоящей Оферте, с приложением документов, обосновывающих предъявляемые требования. Поступившая претензия рассматривается Исполнителем в течение 30 (тридцати) дней с момента ее поступления.

        9.5. При неурегулировании в претензионном порядке спорных вопросов все споры по Договору об образовании или в связи с ним подлежат рассмотрению в соответствии с действующим законодательством Российской Федерации.

        9.6. В любом случае размер ответственности Исполнителя при возмещении убытков в связи с неисполнением/ненадлежащим исполнением Договора об образовании не может превышать Стоимость обучения.

        10. ИНЫЕ ПОЛОЖЕНИЯ

        10.1. Если какое-либо положение Оферты является или становится недействительным в силу противоречия или внесения изменений в действующее законодательство Российской Федерации, то это не является основанием для приостановления действия остальных положений Оферты.

        10.2. Во всем ином, что не предусмотрено текстом Оферты, Стороны руководствуются действующим законодательством Российской Федерации.

        11. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ

        Наименование: Автономная Некоммерческая Организация Дополнительного Профессионального Образования «Образовательные технологии Яндекса»

        Место нахождения: 119021, Россия, г. Москва, ул. Тимура Фрунзе, д. 11, корпус 2

        1147799006123

        ИНН: 7704282033 \\ КПП: 770401001

        тел.: +7 495 739-70-00

        факс: +7 495 739-70-70

        Авторизованный адрес: praktikum@support.yandex.ru

        Режим работы: круглосуточно, без выходных

        Банковские реквизиты:

        Расчетный счёт 40703810800001470659 в АО «Райффайзенбанк»

        БИК: 044525700, Корреспондентский счёт 30101810200000000700

        Дата публикации: 31.01.2025 г.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/23122024.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/05062024.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/01022024.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/17052023.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/04052023.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/19102022.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/27092022.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/10062022.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/28122021.

        Предыдущая версия документа: https://yandex.ru/legal/practicum_offer/23092021.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/31032021.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/04032021.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/29092020.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/29052020.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/25032020.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/20082019.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/25032019.

        Предыдущая версия документа: https://yandex.ru/legal/praktikum_offer/07022019.
        """
}
